<a href="https://colab.research.google.com/github/akki1024/My_Python_Work/blob/master/pandas_dataframes.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# **Pandas Dataframes**

In [2]:
import pandas as pd
file_name = "https://raw.githubusercontent.com/rajeevratan84/datascienceforbusiness/master/titanic.csv"
df = pd.read_csv(file_name)

df

      pclass  ... survived
0          1  ...        1
1          1  ...        1
2          1  ...        0
3          1  ...        0
4          1  ...        0
...      ...  ...      ...
1304       3  ...        0
1305       3  ...        0
1306       3  ...        0
1307       3  ...        0
1308       3  ...        0

[1309 rows x 11 columns]

In [3]:
df.head()

   pclass                                             name  ... embarked  survived
0       1                    Allen, Miss. Elisabeth Walton  ...        S         1
1       1                   Allison, Master. Hudson Trevor  ...        S         1
2       1                     Allison, Miss. Helen Loraine  ...        S         0
3       1             Allison, Mr. Hudson Joshua Creighton  ...        S         0
4       1  Allison, Mrs. Hudson J C (Bessie Waldo Daniels)  ...        S         0

[5 rows x 11 columns]

In [4]:
df.tail()

      pclass                       name     sex  ...  cabin  embarked  survived
1304       3       Zabour, Miss. Hileni  female  ...    NaN         C         0
1305       3      Zabour, Miss. Thamine  female  ...    NaN         C         0
1306       3  Zakarian, Mr. Mapriededer    male  ...    NaN         C         0
1307       3        Zakarian, Mr. Ortin    male  ...    NaN         C         0
1308       3         Zimmerman, Mr. Leo    male  ...    NaN         S         0

[5 rows x 11 columns]

In [5]:
df.head(10)

   pclass                                             name  ... embarked  survived
0       1                    Allen, Miss. Elisabeth Walton  ...        S         1
1       1                   Allison, Master. Hudson Trevor  ...        S         1
2       1                     Allison, Miss. Helen Loraine  ...        S         0
3       1             Allison, Mr. Hudson Joshua Creighton  ...        S         0
4       1  Allison, Mrs. Hudson J C (Bessie Waldo Daniels)  ...        S         0
5       1                              Anderson, Mr. Harry  ...        S         1
6       1                Andrews, Miss. Kornelia Theodosia  ...        S         1
7       1                           Andrews, Mr. Thomas Jr  ...        S         0
8       1    Appleton, Mrs. Edward Dale (Charlotte Lamson)  ...        S         1
9       1                          Artagaveytia, Mr. Ramon  ...        C         0

[10 rows x 11 columns]

In [6]:
df.tail(25)

      pclass  ... survived
1284       3  ...        0
1285       3  ...        0
1286       3  ...        1
1287       3  ...        0
1288       3  ...        0
1289       3  ...        0
1290       3  ...        1
1291       3  ...        0
1292       3  ...        0
1293       3  ...        0
1294       3  ...        0
1295       3  ...        0
1296       3  ...        0
1297       3  ...        0
1298       3  ...        0
1299       3  ...        0
1300       3  ...        1
1301       3  ...        0
1302       3  ...        0
1303       3  ...        0
1304       3  ...        0
1305       3  ...        0
1306       3  ...        0
1307       3  ...        0
1308       3  ...        0

[25 rows x 11 columns]

In [0]:
#Saving a file 
df.to_csv("myDataframe2.csv")

In [0]:
#Saving to excel
df.to_excel("myDataframe2.xlsx")

In [12]:
df.head()

   pclass                                             name  ... embarked  survived
0       1                    Allen, Miss. Elisabeth Walton  ...        S         1
1       1                   Allison, Master. Hudson Trevor  ...        S         1
2       1                     Allison, Miss. Helen Loraine  ...        S         0
3       1             Allison, Mr. Hudson Joshua Creighton  ...        S         0
4       1  Allison, Mrs. Hudson J C (Bessie Waldo Daniels)  ...        S         0

[5 rows x 11 columns]

In [13]:
df.describe()

            pclass          age  ...         fare     survived
count  1309.000000  1046.000000  ...  1308.000000  1309.000000
mean      2.294882    29.881135  ...    33.295479     0.381971
std       0.837836    14.413500  ...    51.758668     0.486055
min       1.000000     0.166700  ...     0.000000     0.000000
25%       2.000000    21.000000  ...     7.895800     0.000000
50%       3.000000    28.000000  ...    14.454200     0.000000
75%       3.000000    39.000000  ...    31.275000     1.000000
max       3.000000    80.000000  ...   512.329200     1.000000

[8 rows x 6 columns]

In [14]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1309 entries, 0 to 1308
Data columns (total 11 columns):
pclass      1309 non-null int64
name        1309 non-null object
sex         1309 non-null object
age         1046 non-null float64
sibsp       1309 non-null int64
parch       1309 non-null int64
ticket      1309 non-null object
fare        1308 non-null float64
cabin       295 non-null object
embarked    1307 non-null object
survived    1309 non-null int64
dtypes: float64(2), int64(4), object(5)
memory usage: 112.6+ KB

Creating Dataframes from non csv files

In [16]:
list_a = ['a','b','c']
list_a

['a', 'b', 'c']

In [17]:
df_a = pd.DataFrame(list_a)
df_a

   0
0  a
1  b
2  c

In [22]:
dict_df = pd.DataFrame({
    'http_status':[200, 200,404,404,301],
    'response_time': [0.04,0.02,0.07,0.52,0.65]})
dict_df

   http_status  response_time
0          200           0.04
1          200           0.02
2          404           0.07
3          404           0.52
4          301           0.65

In [23]:
df.columns

Index(['pclass', 'name', 'sex', 'age', 'sibsp', 'parch', 'ticket', 'fare',
       'cabin', 'embarked', 'survived'],
      dtype='object')

In [25]:
df['name']

0                         Allen, Miss. Elisabeth Walton
1                        Allison, Master. Hudson Trevor
2                          Allison, Miss. Helen Loraine
3                  Allison, Mr. Hudson Joshua Creighton
4       Allison, Mrs. Hudson J C (Bessie Waldo Daniels)
                             ...
1304                               Zabour, Miss. Hileni
1305                              Zabour, Miss. Thamine
1306                          Zakarian, Mr. Mapriededer
1307                                Zakarian, Mr. Ortin
1308                                 Zimmerman, Mr. Leo
Name: name, Length: 1309, dtype: object

## **Indexing and selecting segments in Dataframes**

In [26]:
df.head()

   pclass                                             name  ... embarked  survived
0       1                    Allen, Miss. Elisabeth Walton  ...        S         1
1       1                   Allison, Master. Hudson Trevor  ...        S         1
2       1                     Allison, Miss. Helen Loraine  ...        S         0
3       1             Allison, Mr. Hudson Joshua Creighton  ...        S         0
4       1  Allison, Mrs. Hudson J C (Bessie Waldo Daniels)  ...        S         0

[5 rows x 11 columns]

In [27]:
#df.loc[row_label,column_label]
df.loc[1,"name"]

'Allison, Master. Hudson Trevor'

In [29]:
#Sliciing the entire column
df.loc[:,"name"]

0                         Allen, Miss. Elisabeth Walton
1                        Allison, Master. Hudson Trevor
2                          Allison, Miss. Helen Loraine
3                  Allison, Mr. Hudson Joshua Creighton
4       Allison, Mrs. Hudson J C (Bessie Waldo Daniels)
                             ...
1304                               Zabour, Miss. Hileni
1305                              Zabour, Miss. Thamine
1306                          Zakarian, Mr. Mapriededer
1307                                Zakarian, Mr. Ortin
1308                                 Zimmerman, Mr. Leo
Name: name, Length: 1309, dtype: object

In [30]:
#Alising 
names = df.loc[:,'name']
names

0                         Allen, Miss. Elisabeth Walton
1                        Allison, Master. Hudson Trevor
2                          Allison, Miss. Helen Loraine
3                  Allison, Mr. Hudson Joshua Creighton
4       Allison, Mrs. Hudson J C (Bessie Waldo Daniels)
                             ...
1304                               Zabour, Miss. Hileni
1305                              Zabour, Miss. Thamine
1306                          Zakarian, Mr. Mapriededer
1307                                Zakarian, Mr. Ortin
1308                                 Zimmerman, Mr. Leo
Name: name, Length: 1309, dtype: object

In [34]:
#Slicing a row
df.loc[2,:]

pclass                                 1
name        Allison, Miss. Helen Loraine
sex                               female
age                                    2
sibsp                                  1
parch                                  2
ticket                            113781
fare                              151.55
cabin                            C22 C26
embarked                               S
survived                               0
Name: 2, dtype: object

#  **Slicing using iloc** 
## Syntax: df.iloc[row_index, column_index]


*  **loc**: label based selection
*   **iloc**: integer position based selection

In [35]:
df.head()

   pclass                                             name  ... embarked  survived
0       1                    Allen, Miss. Elisabeth Walton  ...        S         1
1       1                   Allison, Master. Hudson Trevor  ...        S         1
2       1                     Allison, Miss. Helen Loraine  ...        S         0
3       1             Allison, Mr. Hudson Joshua Creighton  ...        S         0
4       1  Allison, Mrs. Hudson J C (Bessie Waldo Daniels)  ...        S         0

[5 rows x 11 columns]

In [38]:
df.iloc[0,1]

'Allen, Miss. Elisabeth Walton'

In [39]:
df.iloc[0]

pclass                                  1
name        Allen, Miss. Elisabeth Walton
sex                                female
age                                    29
sibsp                                   0
parch                                   0
ticket                              24160
fare                              211.338
cabin                                  B5
embarked                                S
survived                                1
Name: 0, dtype: object

## Note: 1 - Dim pandas object is a Series, 2 - Dim pandas object is a DataFrame

In [42]:
#Slicing multiple Columns
df.loc[:,["name","sex"]]

                                                 name     sex
0                       Allen, Miss. Elisabeth Walton  female
1                      Allison, Master. Hudson Trevor    male
2                        Allison, Miss. Helen Loraine  female
3                Allison, Mr. Hudson Joshua Creighton    male
4     Allison, Mrs. Hudson J C (Bessie Waldo Daniels)  female
...                                               ...     ...
1304                             Zabour, Miss. Hileni  female
1305                            Zabour, Miss. Thamine  female
1306                        Zakarian, Mr. Mapriededer    male
1307                              Zakarian, Mr. Ortin    male
1308                               Zimmerman, Mr. Leo    male

[1309 rows x 2 columns]

In [43]:
#Slicing rows similar as well
df.loc[2:4,:]

   pclass                                             name  ... embarked  survived
2       1                     Allison, Miss. Helen Loraine  ...        S         0
3       1             Allison, Mr. Hudson Joshua Creighton  ...        S         0
4       1  Allison, Mrs. Hudson J C (Bessie Waldo Daniels)  ...        S         0

[3 rows x 11 columns]

In [45]:
df.loc[0:,2:6]   #for columns not possible

TypeError: ignored

In [48]:
df.loc[0:,"name"]       #For a specific columns

0                         Allen, Miss. Elisabeth Walton
1                        Allison, Master. Hudson Trevor
2                          Allison, Miss. Helen Loraine
3                  Allison, Mr. Hudson Joshua Creighton
4       Allison, Mrs. Hudson J C (Bessie Waldo Daniels)
                             ...
1304                               Zabour, Miss. Hileni
1305                              Zabour, Miss. Thamine
1306                          Zakarian, Mr. Mapriededer
1307                                Zakarian, Mr. Ortin
1308                                 Zimmerman, Mr. Leo
Name: name, Length: 1309, dtype: object

# Numeric Operation on series

In [53]:
#lets creete a simple dataframe
simple_df = pd.DataFrame({
    'a':[1,2,3,4,5,6],
    'b':[5,10,15,20,25,30]})
simple_df

   a   b
0  1   5
1  2  10
2  3  15
3  4  20
4  5  25
5  6  30

In [55]:
#Extract a series for a
a = simple_df['a']
a

0    1
1    2
2    3
3    4
4    5
5    6
Name: a, dtype: int64

In [57]:
b = simple_df['b']
b

0     5
1    10
2    15
3    20
4    25
5    30
Name: b, dtype: int64

In [59]:
c  = a + b
c

0     6
1    12
2    18
3    24
4    30
5    36
dtype: int64

In [60]:
d = a*b
d

0      5
1     20
2     45
3     80
4    125
5    180
dtype: int64

# Descriptive Stats on series

In [61]:
a.max()

6

In [62]:
a.min()

1

In [63]:
a.mean()

3.5

In [65]:
a.median()

3.5

In [66]:
a.mode()

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64

In [67]:
b.mode()

0     5
1    10
2    15
3    20
4    25
5    30
dtype: int64

In [68]:
b.sum()

105

In [69]:
b

0     5
1    10
2    15
3    20
4    25
5    30
Name: b, dtype: int64

In [70]:
b.value_counts()

15    1
30    1
5     1
20    1
10    1
25    1
Name: b, dtype: int64

In [71]:
b.describe()

count     6.000000
mean     17.500000
std       9.354143
min       5.000000
25%      11.250000
50%      17.500000
75%      23.750000
max      30.000000
Name: b, dtype: float64

In [72]:
df.head()

   pclass                                             name  ... embarked  survived
0       1                    Allen, Miss. Elisabeth Walton  ...        S         1
1       1                   Allison, Master. Hudson Trevor  ...        S         1
2       1                     Allison, Miss. Helen Loraine  ...        S         0
3       1             Allison, Mr. Hudson Joshua Creighton  ...        S         0
4       1  Allison, Mrs. Hudson J C (Bessie Waldo Daniels)  ...        S         0

[5 rows x 11 columns]

In [73]:
df['sex'].describe()

count     1309
unique       2
top       male
freq       843
Name: sex, dtype: object

In [78]:
df['pclass'].unique()

array([1, 2, 3])

In [79]:
df['age'].unique()

array([29.    ,  0.9167,  2.    , 30.    , 25.    , 48.    , 63.    ,
       39.    , 53.    , 71.    , 47.    , 18.    , 24.    , 26.    ,
       80.    ,     nan, 50.    , 32.    , 36.    , 37.    , 42.    ,
       19.    , 35.    , 28.    , 45.    , 40.    , 58.    , 22.    ,
       41.    , 44.    , 59.    , 60.    , 33.    , 17.    , 11.    ,
       14.    , 49.    , 76.    , 46.    , 27.    , 64.    , 55.    ,
       70.    , 38.    , 51.    , 31.    ,  4.    , 54.    , 23.    ,
       43.    , 52.    , 16.    , 32.5   , 21.    , 15.    , 65.    ,
       28.5   , 45.5   , 56.    , 13.    , 61.    , 34.    ,  6.    ,
       57.    , 62.    , 67.    ,  1.    , 12.    , 20.    ,  0.8333,
        8.    ,  0.6667,  7.    ,  3.    , 36.5   , 18.5   ,  5.    ,
       66.    ,  9.    ,  0.75  , 70.5   , 22.5   ,  0.3333,  0.1667,
       40.5   , 10.    , 23.5   , 34.5   , 20.5   , 30.5   , 55.5   ,
       38.5   , 14.5   , 24.5   , 60.5   , 74.    ,  0.4167, 11.5   ,
       26.5   ])